In [1]:
import pandas as pd
import numpy as np

In [2]:
flowers= ["Tulip","Rose","Lily"]
flowers

['Tulip', 'Rose', 'Lily']

In [3]:
pd.Series(flowers)

0    Tulip
1     Rose
2     Lily
dtype: object

In [4]:
pd.Series(flowers,index=["f1","f2","f3"])

f1    Tulip
f2     Rose
f3     Lily
dtype: object

In [6]:
number=[10,20,None]
pd.Series(number,index=[1,2,3])

1    10.0
2    20.0
3     NaN
dtype: float64

In [7]:
type(pd.Series(number))

pandas.core.series.Series

In [8]:
pd.Series?

In [11]:
music={"Rock" : "Queen",
      "Pop Rock" : "coldplay",
     "pop" : "maroon" }
music

{'Rock': 'Queen', 'Pop Rock': 'coldplay', 'pop': 'maroon'}

In [13]:
a=pd.Series(music)

In [16]:
a["Rock"]

'Queen'

In [17]:
a.index

Index(['Rock', 'Pop Rock', 'pop'], dtype='object')

In [18]:
a.index[0]

'Rock'

In [19]:
a=pd.Series(np.random.randint(1,200,10000))

In [21]:
a.head()

0    135
1     52
2    181
3     14
4    174
dtype: int32

In [22]:
a

0       135
1        52
2       181
3        14
4       174
       ...
9995    179
9996     68
9997     45
9998     59
9999     16
Length: 10000, dtype: int32

In [23]:
len(a)

10000

In [30]:
b=pd.Series(["Rose","Lily","Lily1"],index=[1,2,3])

In [31]:
b

1     Rose
2     Lily
3    Lily1
dtype: object

In [32]:

b[4]="lily2"

In [33]:
b

1     Rose
2     Lily
3    Lily1
4    lily2
dtype: object

In [34]:
fresh_flowers = pd.Series({"White" : "Tulip",
                          "Red" : "Rose",
                          "Purple" : "Lily"})
fresh_flowers

White     Tulip
Red        Rose
Purple     Lily
dtype: object

In [36]:
flowers_purple=pd.Series(["cosmos","iris","lavender"],index=["purple","purple","purple"])

In [37]:
flowers_purple

purple      cosmos
purple        iris
purple    lavender
dtype: object

In [38]:
pd.concat([fresh_flowers,flowers_purple])

White        Tulip
Red           Rose
Purple        Lily
purple      cosmos
purple        iris
purple    lavender
dtype: object

In [40]:
flowers=fresh_flowers.append(flowers_purple)

In [41]:
flowers

White        Tulip
Red           Rose
Purple        Lily
purple      cosmos
purple        iris
purple    lavender
dtype: object

In [43]:
flowers['purple']

purple      cosmos
purple        iris
purple    lavender
dtype: object

##   Data Frame

In [44]:
import pandas as pd

In [49]:
t1 =pd.Series({"item#" :"01",
              "item_name":"Dog food",
              "cost$": 21.30})
t2=pd.Series({"item#":"02",
             "item_name": "cat food",
             "cost$" : "15:10"})
t3=pd.Series({"item#":"03",
             "item_name": "Bird food",
             "cost$" : "12:50"})

In [50]:
t1

item#              01
item_name    Dog food
cost$            21.3
dtype: object

In [51]:
df = pd.DataFrame([t1,t2,t3])

In [52]:
df

  item#  item_name  cost$
0    01   Dog food   21.3
1    02   cat food  15:10
2    03  Bird food  12:50

In [53]:
type(df)

pandas.core.frame.DataFrame

In [57]:
df = pd.DataFrame([t1,t2,t3],index =["i1","i2","i3"])

In [58]:
df

   item#  item_name  cost$
i1    01   Dog food   21.3
i2    02   cat food  15:10
i3    03  Bird food  12:50

In [59]:
pd.concat([t1,t2])

item#              01
item_name    Dog food
cost$            21.3
item#              02
item_name    cat food
cost$           15:10
dtype: object

In [63]:
var=[t1,t3]

In [64]:
var

[item#              01
 item_name    Dog food
 cost$            21.3
 dtype: object,
 item#               03
 item_name    Bird food
 cost$            12:50
 dtype: object]

In [65]:
pd.concat(var)

item#               01
item_name     Dog food
cost$             21.3
item#               03
item_name    Bird food
cost$            12:50
dtype: object

In [66]:
t1 = pd.DataFrame({"Item#" : ["01", "02", "03"],
                  "Item Name" : ["Dog food", "Bird food", "Fish food"],
                  "Cost" : [21.50, 10.5, 25.0]},index = [0, 1, 3])
t1

  Item#  Item Name  Cost
0    01   Dog food  21.5
1    02  Bird food  10.5
3    03  Fish food  25.0

In [67]:
t2 = pd.DataFrame({"Item#" : ["01", "02", "06"],
                  "Item Name" : ["Cat food", "Bird food", "Fish food"],
                  "Cost" : [15.10, 9.5, 15.0]}, index = [0, 1, 3])
t2

  Item#  Item Name  Cost
0    01   Cat food  15.1
1    02  Bird food   9.5
3    06  Fish food  15.0

In [68]:
newTrans = [t1, t2]

In [69]:
newTrans

[  Item#  Item Name  Cost
 0    01   Dog food  21.5
 1    02  Bird food  10.5
 3    03  Fish food  25.0,
   Item#  Item Name  Cost
 0    01   Cat food  15.1
 1    02  Bird food   9.5
 3    06  Fish food  15.0]

In [70]:
pd.concat(newTrans)

  Item#  Item Name  Cost
0    01   Dog food  21.5
1    02  Bird food  10.5
3    03  Fish food  25.0
0    01   Cat food  15.1
1    02  Bird food   9.5
3    06  Fish food  15.0

In [71]:
pd.concat(newTrans,axis=1,join="inner")

  Item#  Item Name  Cost Item#  Item Name  Cost
0    01   Dog food  21.5    01   Cat food  15.1
1    02  Bird food  10.5    02  Bird food   9.5
3    03  Fish food  25.0    06  Fish food  15.0

In [72]:
pd.concat(newTrans,axis=0,join="inner")

  Item#  Item Name  Cost
0    01   Dog food  21.5
1    02  Bird food  10.5
3    03  Fish food  25.0
0    01   Cat food  15.1
1    02  Bird food   9.5
3    06  Fish food  15.0

In [75]:
pd.merge(t1,t2,how ="left", on = "Item#", sort =True )

  Item# Item Name_x  Cost_x Item Name_y  Cost_y
0    01    Dog food    21.5    Cat food    15.1
1    02   Bird food    10.5   Bird food     9.5
2    03   Fish food    25.0         NaN     NaN

In [76]:
pd.merge(t1,t2,how ="left", on = "Item Name", sort =True )

  Item#_x  Item Name  Cost_x Item#_y  Cost_y
0      02  Bird food    10.5      02     9.5
1      01   Dog food    21.5     NaN     NaN
2      03  Fish food    25.0      06    15.0

In [79]:
df=pd.merge(t1,t2,how ="left", on =["Item#", "Item Name"], sort =True )

In [80]:
df

  Item#  Item Name  Cost_x  Cost_y
0    01   Dog food    21.5     NaN
1    02  Bird food    10.5     9.5
2    03  Fish food    25.0     NaN

In [81]:
df.loc[1]

Item#               02
Item Name    Bird food
Cost_x            10.5
Cost_y             9.5
Name: 1, dtype: object

In [83]:
type(df["Cost_x"])

pandas.core.series.Series

In [84]:
type(df["Cost_y"])

pandas.core.series.Series

In [85]:
df = pd.DataFrame({"Store" : ["WalMart", "Amazon", "Flipkart"],
                  "Revenue" : [100, 100000, 110],
                  "Country" : ["USA", "USA", "INDIA"]})

In [86]:
df

      Store  Revenue Country
0   WalMart      100     USA
1    Amazon   100000     USA
2  Flipkart      110   INDIA

In [87]:
df.loc[1]

Store      Amazon
Revenue    100000
Country       USA
Name: 1, dtype: object

In [88]:
df.T

               0       1         2
Store    WalMart  Amazon  Flipkart
Revenue      100  100000       110
Country      USA     USA     INDIA

In [89]:
type(df["Store"])

pandas.core.series.Series

In [90]:
df.loc[:, ["Revenue", "Store"]]

   Revenue     Store
0      100   WalMart
1   100000    Amazon
2      110  Flipkart

In [91]:
t1

  Item#  Item Name  Cost
0    01   Dog food  21.5
1    02  Bird food  10.5
3    03  Fish food  25.0

In [92]:
t1.drop(0)

  Item#  Item Name  Cost
1    02  Bird food  10.5
3    03  Fish food  25.0

In [94]:
t1_copy=t1.copy()
t1_copy

  Item#  Item Name  Cost
0    01   Dog food  21.5
1    02  Bird food  10.5
3    03  Fish food  25.0

In [95]:
t1_copy.drop(3)

  Item#  Item Name  Cost
0    01   Dog food  21.5
1    02  Bird food  10.5

In [96]:
del t1_copy["Cost"]

In [97]:
t1_copy

  Item#  Item Name
0    01   Dog food
1    02  Bird food
3    03  Fish food